---
kind: other
id: AllMembers.T:Autodesk.Revit.DB.Analysis.AnalysisDisplayMarkersAndTextSettings
source: html/c1df8768-13a5-0b65-eb24-b49b671a88ca.htm
---
# AnalysisDisplayMarkersAndTextSettings Members

Constructs a default instance of markers and text settings.